lcars-coffee/app/views/suppliers/index.html.erb

    <span class="lcars-badge">
      <%= supplier.beans.count %> SKU
---
SELECT COUNT(*) FROM "beans" WHERE "beans"."supplier_id" = 4

    <div class="lcars-stat">
      stk <%= supplier.beans.sum(:quantity) %>
---
SELECT SUM("beans"."quantity") FROM "beans" WHERE "beans"."supplier_id" = 4

    <p>
      cr <%= supplier.beans.sum("price * quantity") %> value
---
SELECT SUM(price * quantity) FROM "beans" WHERE "beans"."supplier_id" = 4