lcars-coffee/app/controllers/beans_controller.rb

  def index
    @beans = Bean.all
---
SELECT "beans".* FROM "beans"