lcars-coffee/app/views/beans/analysis.html.erb


  <% Bean.order(quantity: :desc).limit(5).each do |bean| %>
---
SELECT "beans".* FROM "beans" ORDER BY "beans"."quantity" DESC LIMIT 5